#### Ordinal Number Encoding

In [23]:
 import datetime

In [24]:
today_date = datetime.datetime.today()

In [25]:
today_date

datetime.datetime(2021, 5, 11, 18, 46, 9, 350592)

In [26]:
today_date-datetime.timedelta(1)

datetime.datetime(2021, 5, 10, 18, 46, 9, 350592)

In [27]:
date = [today_date-datetime.timedelta(i) for i in range(0,15)]

In [28]:
date

[datetime.datetime(2021, 5, 11, 18, 46, 9, 350592),
 datetime.datetime(2021, 5, 10, 18, 46, 9, 350592),
 datetime.datetime(2021, 5, 9, 18, 46, 9, 350592),
 datetime.datetime(2021, 5, 8, 18, 46, 9, 350592),
 datetime.datetime(2021, 5, 7, 18, 46, 9, 350592),
 datetime.datetime(2021, 5, 6, 18, 46, 9, 350592),
 datetime.datetime(2021, 5, 5, 18, 46, 9, 350592),
 datetime.datetime(2021, 5, 4, 18, 46, 9, 350592),
 datetime.datetime(2021, 5, 3, 18, 46, 9, 350592),
 datetime.datetime(2021, 5, 2, 18, 46, 9, 350592),
 datetime.datetime(2021, 5, 1, 18, 46, 9, 350592),
 datetime.datetime(2021, 4, 30, 18, 46, 9, 350592),
 datetime.datetime(2021, 4, 29, 18, 46, 9, 350592),
 datetime.datetime(2021, 4, 28, 18, 46, 9, 350592),
 datetime.datetime(2021, 4, 27, 18, 46, 9, 350592)]

In [29]:
import pandas as pd
data = pd.DataFrame(date)
data.columns = ['Day']

In [30]:
data.head()

                         Day
0 2021-05-11 18:46:09.350592
1 2021-05-10 18:46:09.350592
2 2021-05-09 18:46:09.350592
3 2021-05-08 18:46:09.350592
4 2021-05-07 18:46:09.350592

In [42]:
data['Weekday'] = data['Day'].dt.day_name()

In [43]:
data.head()

                         Day   Weekday
0 2021-05-11 18:46:09.350592   Tuesday
1 2021-05-10 18:46:09.350592    Monday
2 2021-05-09 18:46:09.350592    Sunday
3 2021-05-08 18:46:09.350592  Saturday
4 2021-05-07 18:46:09.350592    Friday

In [44]:
dic = {'Monday': 1,'Tuesday': 2,'Wednesday': 3,'Thursday': 4,'Friday':5,'Saturday':6,'Sunday':7}

In [45]:
dic

{'Monday': 1,
 'Tuesday': 2,
 'Wednesday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [47]:
data["Ordinal_data"] = data['Weekday'].map(dic)

In [49]:
data.head()

                         Day   Weekday  Ordinal_data
0 2021-05-11 18:46:09.350592   Tuesday             2
1 2021-05-10 18:46:09.350592    Monday             1
2 2021-05-09 18:46:09.350592    Sunday             7
3 2021-05-08 18:46:09.350592  Saturday             6
4 2021-05-07 18:46:09.350592    Friday             5

#### Count or Freaquency encoding

In [68]:
data = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data',header=  None,index_col=None)

In [69]:
data.head()

   0                  1       2           3   4                    5   ...       9     10 11  12              13      14
0  39          State-gov   77516   Bachelors  13        Never-married  ...     Male  2174  0  40   United-States   <=50K
1  50   Self-emp-not-inc   83311   Bachelors  13   Married-civ-spouse  ...     Male     0  0  13   United-States   <=50K
2  38            Private  215646     HS-grad   9             Divorced  ...     Male     0  0  40   United-States   <=50K
3  53            Private  234721        11th   7   Married-civ-spouse  ...     Male     0  0  40   United-States   <=50K
4  28            Private  338409   Bachelors  13   Married-civ-spouse  ...   Female     0  0  40            Cuba   <=50K

[5 rows x 15 columns]

In [70]:
columns = [1,3,5,6,7,8,9,13]

In [71]:
data = data[columns]

In [72]:
data.columns=['Employement','Degree','Status','Designation','Family_job','Race','Sex','Country']

In [73]:
data.head()

         Employement      Degree               Status  ...    Race      Sex         Country
0          State-gov   Bachelors        Never-married  ...   White     Male   United-States
1   Self-emp-not-inc   Bachelors   Married-civ-spouse  ...   White     Male   United-States
2            Private     HS-grad             Divorced  ...   White     Male   United-States
3            Private        11th   Married-civ-spouse  ...   Black     Male   United-States
4            Private   Bachelors   Married-civ-spouse  ...   Black   Female            Cuba

[5 rows x 8 columns]

In [77]:
for feature in data.columns:
    print(feature, len(data[feature].unique()),'labels')

Employement 9 labels
Degree 16 labels
Status 7 labels
Designation 15 labels
Family_job 6 labels
Race 5 labels
Sex 2 labels
Country 42 labels

In [78]:
data['Country'].value_counts()

 United-States                 29170
 Mexico                          643
 ?                               583
 Philippines                     198
 Germany                         137
 Canada                          121
 Puerto-Rico                     114
 El-Salvador                     106
 India                           100
 Cuba                             95
 England                          90
 Jamaica                          81
 South                            80
 China                            75
 Italy                            73
 Dominican-Republic               70
 Vietnam                          67
 Guatemala                        64
 Japan                            62
 Poland                           60
 Columbia                         59
 Taiwan                           51
 Haiti                            44
 Iran                             43
 Portugal                         37
 Nicaragua                        34
 Peru                             31
 France                           29
 Greece                           29
 Ecuador                          28
 Ireland                          24
 Hong                             20
 Cambodia                         19
 Trinadad&Tobago                  19
 Thailand                         18
 Laos                             18
 Yugoslavia                       16
 Outlying-US(Guam-USVI-etc)       14
 Honduras                         13
 Hungary                          13
 Scotland                         12
 Holand-Netherlands                1
Name: Country, dtype: int64

In [81]:
data['Country'] = data['Country'].map(data['Country'].value_counts())

In [82]:
data.head()

         Employement      Degree               Status         Designation      Family_job    Race      Sex  Country
0          State-gov   Bachelors        Never-married        Adm-clerical   Not-in-family   White     Male    29170
1   Self-emp-not-inc   Bachelors   Married-civ-spouse     Exec-managerial         Husband   White     Male    29170
2            Private     HS-grad             Divorced   Handlers-cleaners   Not-in-family   White     Male    29170
3            Private        11th   Married-civ-spouse   Handlers-cleaners         Husband   Black     Male    29170
4            Private   Bachelors   Married-civ-spouse      Prof-specialty            Wife   Black   Female       95

#### Target Guided Ordinal Encoding
1. Ordering labels according to the target
2. Replace the labels by the joint probablity of being 1 or 0

In [134]:
data = pd.read_csv('titanic.csv',usecols=['Survived','Cabin'])

In [135]:
data.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [136]:
data['Cabin'] = data['Cabin'].fillna('Missing')

In [137]:
data.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [138]:
data['Cabin'] = data['Cabin'].astype(str).str[0]

In [139]:
data.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [140]:
data.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [141]:
data.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [142]:
data.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [143]:
ordinal_labels = data.groupby(['Cabin'])['Survived'].mean().sort_values().index
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [144]:
data1 = {k:i for i,k in enumerate(ordinal_labels,0)}

In [145]:
data['Cabin'] = data['Cabin'].map(data1)

In [146]:
data.head()

   Survived  Cabin
0         0      1
1         1      4
2         1      1
3         1      4
4         0      1

 #### Mean Encoding

In [161]:
data = pd.read_csv('titanic.csv',usecols=['Survived','Cabin'])

In [162]:
data['Cabin'] = data['Cabin'].fillna('Missing')

In [163]:
data['Cabin'] = data['Cabin'].astype(str).str[0]

In [164]:
mean_encod =  data.groupby(['Cabin'])['Survived'].mean().to_dict()

In [166]:
mean_encod

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [167]:
data['Cabin_Mean'] = data['Cabin'].map(mean_encod)

In [168]:
data.head()

   Survived Cabin  Cabin_Mean
0         0     M    0.299854
1         1     C    0.593220
2         1     M    0.299854
3         1     C    0.593220
4         0     M    0.299854

#### Probablity Ration Encoding

In [170]:
import pandas as pd

In [171]:
df = pd.read_csv('titanic.csv',usecols=['Survived','Cabin'])

In [172]:
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [181]:
df['Cabin_prob'] = df['Cabin'].fillna('Missing')

In [182]:
df.head()

   Survived Cabin Cabin_prob
0         0   NaN    Missing
1         1   C85        C85
2         1   NaN    Missing
3         1  C123       C123
4         0   NaN    Missing

In [183]:
df['Cabin_prob'] = df['Cabin_prob'].astype(str).str[0]

In [184]:
df.head()

   Survived Cabin Cabin_prob
0         0   NaN          M
1         1   C85          C
2         1   NaN          M
3         1  C123          C
4         0   NaN          M

In [190]:
df['Cabin_prob'].unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [191]:
new_data = df.groupby(['Cabin_prob'])['Survived'].mean()

In [192]:
new_data = pd.DataFrame(new_data)

In [194]:
new_data

            Survived
Cabin_prob
A           0.466667
B           0.744681
C           0.593220
D           0.757576
E           0.750000
F           0.615385
G           0.500000
M           0.299854
T           0.000000

In [197]:
new_data['Death'] = 1-new_data['Survived']

In [198]:
new_data

            Survived     Death
Cabin_prob
A           0.466667  0.533333
B           0.744681  0.255319
C           0.593220  0.406780
D           0.757576  0.242424
E           0.750000  0.250000
F           0.615385  0.384615
G           0.500000  0.500000
M           0.299854  0.700146
T           0.000000  1.000000

In [199]:
new_data['Probability_ratio'] = new_data['Survived'] / new_data['Death']

In [200]:
new_data

            Survived     Death  Probability_ratio
Cabin_prob
A           0.466667  0.533333           0.875000
B           0.744681  0.255319           2.916667
C           0.593220  0.406780           1.458333
D           0.757576  0.242424           3.125000
E           0.750000  0.250000           3.000000
F           0.615385  0.384615           1.600000
G           0.500000  0.500000           1.000000
M           0.299854  0.700146           0.428274
T           0.000000  1.000000           0.000000

In [201]:
df['Cabin_prob'] = df['Cabin_prob'].map(new_data['Probability_ratio'])

In [202]:
df.head()

   Survived Cabin  Cabin_prob
0         0   NaN    0.428274
1         1   C85    1.458333
2         1   NaN    0.428274
3         1  C123    1.458333
4         0   NaN    0.428274